[
  {
    "no": 27,
    "key": "geoit_developer",
    "rank": 1,
    "name": "GeoIT Developer",
    "about_original": "My Portfolio Website",
    "about": "My Portfolio Website",
    "description": "GeoIT Developer is a portfolio website showcasing the skills and projects by Alf-Anas. Built using ReactJS, NextJS, and enhanced with Tailwind CSS and Ant Design for a sleek and responsive user interface. The project is mainly about merging geography and technology.",
    "affiliation": "",
    "platform": "Web",
    "tech_stack": "ReactJS, NextJS, Tailwind CSS, Ant Design, JavaScript, TypeScript, HTML, CSS",
    "url": "https://geoit.dev/",
    "source_code": "",
    "year": "2021, 2022, 2023",
    "status": "Active",
    "logo": "",
    "file": "",
    "video": "",
    "youtube": ""
  },
  {
    "no": 2,
    "key": "siasn_instansi",
    "rank": 2,
    "name": "SIASN Instansi",
    "about_original": "Application for data integration of ASN (civil servant) in Indonesia. This is an internal app for ASN only.",
    "about": "Application for data integration of ASN (civil servant) in Indonesia. This is an internal app for ASN only.",
    "description": "SIASN Instansi is an internal application designed for the integration of civil servant data in Indonesia. Developed by Badan Kepegawaian Negara (BKN), the app utilizes ReactJS, NextJS, and a tech stack including Ant Design and Redux for efficient data management.",
    "affiliation": "bkn",
    "platform": "Web",
    "tech_stack": "ReactJS, NextJS, Ant Design, Bootstrap, Redux, KeyCloak, TypeScript, JavaScript, HTML, CSS",
    "url": "https://siasn-instansi.bkn.go.id/",
    "source_code": "",
    "year": "2022, 2023",
    "status": "Active",
    "logo": "siasn_instansi.png",
    "file": "",
    "video": "",
    "youtube": ""
  },
  {
    "no": 1,
    "key": "tender_ease",
    "rank": 3,
    "name": "TenderEase",
    "about_original": "The all-in-one solution for managing, creating, and finding tenders",
    "about": "The all-in-one solution for managing, creating, and finding tenders",
    "description": "TenderEase is the ultimate solution for managing, creating, and discovering tenders. Developed in collaboration with Kolibri for Impact, the web platform is powered by ReactJS, NextJS, GraphQL, and a robust tech stack including Material UI and TypeScript for seamless tender management.",
    "affiliation": "kolibri",
    "platform": "Web",
    "tech_stack": "ReactJS, NextJS, GraphQL, Refine, Material UI, Zustand, TypeScript, JavaScript, HTML, CSS",
    "url": "https://tenderease.app/",
    "source_code": "",
    "year": "2023",
    "status": "Active",
    "logo": "",
    "file": "",
    "video": "",
    "youtube": ""
  },
  {
    "no": 26,
    "key": "electoral_redistricting_app",
    "rank": 4,
    "name": "Electoral Redistricting App",
    "about_original": "Boundary Delimitation Tool is a tool to draw electoral district boundaries and to assist in the electoral delineation process. This app is a cooperation between Perludem and QGIS Indonesia.",
    "about": "Boundary Delimitation Tool is a tool to draw electoral district boundaries and assist in the electoral delineation process. This app is a cooperation between Perludem and QGIS Indonesia.",
    "description": "Electoral Redistricting App, also known as the Boundary Delimitation Tool, is a collaborative effort between Perludem, International IDEA, and QGIS User Group Indonesia. This cross-platform application, available on both the web and Windows, leverages ReactJS, NextJS, and a diverse tech stack, including OpenLayers and ElectronJS, to facilitate the electoral district boundary drawing and delineation process.",
    "affiliation": "perludem, qgis_id, idea_int",
    "platform": "Web, Windows",
    "tech_stack": "ReactJS, NextJS, Tailwind CSS, OpenLayers, LeafletJS, TurfJS, ElectronJS, JavaScript, HTML, CSS, PHP, MySQL",
    "url": "https://era.idea.int/#/",
    "source_code": "",
    "year": "2021, 2022",
    "status": "Completed",
    "logo": "electoral_redistricting_app.png",
    "file": "",
    "video": "",
    "youtube": ""
  },
  {
    "no": 28,
    "key": "jaga_suara",
    "rank": 5,
    "name": "Jaga Suara",
    "about_original": "Application for election vote analysis in Indonesia. By collecting data of previous election, we can analyst the data for strategizing in future election.",
    "about": "Application for election vote analysis in Indonesia. By collecting data from the previous election, we can analyze the data for strategizing in future elections.",
    "description": "Jaga Suara is a versatile application designed for election vote analysis in Indonesia. Compatible with various platforms including Web, PWA, TWA, and Android, the app utilizes ReactJS and Material UI along with advanced mapping technologies such as Mapbox GL JS and TurfJS. Data collection and analysis from previous elections empower strategic planning for future electoral campaigns.",
    "affiliation": "",
    "platform": "Web, PWA, TWA, Android, Multiplatform",
    "tech_stack": "ReactJS, Material UI, Mapbox GL JS, TurfJS, JavaScript, HTML, CSS, Bubblewrap, IndexedDB, PHP",
    "url": "https://jagasuara.id/",
    "source_code": "",
    "year": "2021, 2022",
    "status": "Completed",
    "logo": "jaga_suara.png",
    "file": "jaga_suara.pdf",
    "video": "",
    "youtube": ""
  },
  {
    "no": 29,
    "key": "batas_administrasi_indonesia",
    "rank": 6,
    "name": "Batas Administrasi Indonesia",
    "about_original": "An app for downloading administration boundary in Indonesia from Province level to village level.",
    "about": "An app for downloading administrative boundaries in Indonesia from the province level to the village level.",
    "description": "Batas Administrasi Indonesia is a web application designed for downloading administrative boundaries in Indonesia, ranging from the province level to the village level. Developed using ReactJS, NextJS, and a tech stack including Ant Design and MapLibre, the app ensures a user-friendly experience for accessing and managing administrative boundary data.",
    "affiliation": "",
    "platform": "Web",
    "tech_stack": "ReactJS, NextJS, Ant Design, Tailwind CSS, MapLibre, TurfJS, JavaScript, TypeScript, HTML, CSS, SQLite, PHP",
    "url": "https://batas-admin.geoit.dev/",
    "source_code": "https://github.com/Alf-Anas/batas-admin-nextjs",
    "year": "2023",
    "status": "Completed",
    "logo": "",
    "file": "",
    "video": "",
    "youtube": ""
  },
  {
    "no": 19,
    "key": "fusion_flow_v2",
    "rank": 7,
    "name": "Fusion Flow V2",
    "about_original": "A platform for managing node from different cloud provider.",
    "about": "A platform for managing nodes from different cloud providers.",
    "description": "Fusion Flow V2 is a robust platform developed by Skylab Cloud Technologies for efficiently managing nodes from various cloud providers. The web-based platform leverages technologies such as ReactJS, NextJS, and Redux Saga, combined with Cloudscape Design for seamless node management and coordination across different cloud environments.",
    "affiliation": "skylab",
    "platform": "Web",
    "tech_stack": "ReactJS, NextJS, Cloudscape Design, Redux Saga, Lodash, Husky, JavaScript, TypeScript, HTML, CSS",
    "url": "",
    "source_code": "",
    "year": "2023",
    "status": "Completed",
    "logo": "",
    "file": "",
    "video": "",
    "youtube": ""
  },
  {
    "no": 17,
    "key": "platform_manager",
    "rank": 8,
    "name": "Platform Manager",
    "about_original": "A platform for managing all cloud server from different cloud provider.",
    "about": "A platform for managing all cloud servers from different cloud providers.",
    "description": "Platform Manager, developed by Skylab Cloud Technologies, is a comprehensive web-based platform designed for efficient management of cloud servers across diverse providers. The platform, built using ReactJS, NextJS, and Material UI, incorporates Redux Saga for streamlined server management and coordination.",
    "affiliation": "skylab",
    "platform": "Web",
    "tech_stack": "ReactJS, NextJS, Material UI, Redux Saga, Lodash, Husky, JavaScript, TypeScript, HTML, CSS",
    "url": "",
    "source_code": "",
    "year": "2022, 2023",
    "status": "Completed",
    "logo": "",
    "file": "",
    "video": "",
    "youtube": ""
  },
  {
    "no": 33,
    "key": "files_and_folders_to_excel",
    "rank": 9,
    "name": "Files and Folders to Excel",
    "about_original": "A script to list files and folders to spreadsheet format",
    "about": "A script to list files and folders in spreadsheet format.",
    "description": "Files and Folders to Excel is a handy script developed for PT. Surveyor Indonesia. This Windows-based script utilizes JavaScript, Excel, VBA, and integrates with Google Drive and Google AppsScript to efficiently list files and folders in spreadsheet format, providing a convenient and organized way to manage data.",
    "affiliation": "ptsi",
    "platform": "Windows, Script, Automation",
    "tech_stack": "JavaScript, Excel, VBA, Google Drive, Google AppsScript",
    "url": "",
    "source_code": "https://github.com/Alf-Anas/script-to-list-files-and-folders-to-excel",
    "year": "2023",
    "status": "Completed",
    "logo": "",
    "file": "",
    "video": "",
    "youtube": ""
  },
  {
    "no": 3,
    "key": "siasn_bkn_skk",
    "rank": 10,
    "name": "SIASN BKN SKK",
    "about_original": "A web app for managing and processing incoming proposal data from another civil servant institution to changing their basic data",
    "about": "A web app for managing and processing incoming proposal data from another civil servant institution to change their basic data.",
    "description": "SIASN BKN SKK is a web application developed by Badan Kepegawaian Negara (BKN) for efficiently managing and processing incoming proposal data from another civil servant institution. The app, built using ReactJS, NextJS, and a tech stack including Ant Design and Redux, ensures seamless processing of proposals, including changes to basic data.",
    "affiliation": "bkn",
    "platform": "Web",
    "tech_stack": "ReactJS, NextJS, Ant Design, Bootstrap, Redux, KeyCloak, TypeScript, JavaScript, HTML, CSS, HTML, CSS",
    "url": "https://skk-siasn.bkn.go.id/",
    "source_code": "",
    "year": "2022, 2023",
    "status": "Active",
    "logo": "",
    "file": "",
    "video": "",
    "youtube": ""
  },
  {
    "no": 4,
    "key": "siasn_bkn_pemberhentian_pensiun",
    "rank": 11,
    "name": "SIASN BKN Pemberhentian / Pensiun",
    "about_original": "A web app for managing and processing incoming proposal data from another civil servant institution to create the pension or work termination",
    "about": "A web app for managing and processing incoming proposal data from another civil servant institution to create pensions or work termination.",
    "description": "SIASN BKN Pemberhentian / Pensiun is a web application developed by Badan Kepegawaian Negara (BKN) for efficiently managing and processing incoming proposal data related to pensions or work termination from another civil servant institution. The app, built using ReactJS, NextJS, and a tech stack including Ant Design and Redux, ensures a streamlined process for handling such proposals.",
    "affiliation": "bkn",
    "platform": "Web",
    "tech_stack": "ReactJS, NextJS, Ant Design, Bootstrap, Redux, KeyCloak, TypeScript, JavaScript, HTML, CSS",
    "url": "https://pemberhentian-siasn.bkn.go.id/",
    "source_code": "",
    "year": "2022, 2023",
    "status": "Active",
    "logo": "",
    "file": "",
    "video": "",
    "youtube": ""
  },
  {
    "no": 5,
    "key": "siasn_bkn_pengadaan_penetapan_nip",
    "rank": 12,
    "name": "SIASN BKN Pengadaan / Penetapan NIP",
    "about_original": "A web app for managing and processing incoming proposal data from another civil servant institution to generate new ASN ID number",
    "about": "A web app for managing and processing incoming proposal data from another civil servant institution to generate new ASN ID numbers.",
    "description": "SIASN BKN Pengadaan / Penetapan NIP is a web application developed by Badan Kepegawaian Negara (BKN) for efficiently managing and processing incoming proposal data from another civil servant institution. The app, built using ReactJS, NextJS, and a tech stack including Ant Design and Redux, focuses on generating new ASN ID numbers, ensuring accuracy and efficiency in the process.",
    "affiliation": "bkn",
    "platform": "Web",
    "tech_stack": "ReactJS, NextJS, Ant Design, Bootstrap, Redux, KeyCloak, TypeScript, JavaScript, HTML, CSS",
    "url": "https://penetapannip-siasn.bkn.go.id/",
    "source_code": "",
    "year": "2022, 2023",
    "status": "Active",
    "logo": "",
    "file": "",
    "video": "",
    "youtube": ""
  },
  {
    "no": 9,
    "key": "valid_siasn",
    "rank": 13,
    "name": "Valid SIASN",
    "about_original": "A web app to check the validity of document that generate from all SIASN apps",
    "about": "A web app to check the validity of documents generated from all SIASN apps.",
    "description": "Valid SIASN is a web application developed by Badan Kepegawaian Negara (BKN) to facilitate the validation of documents generated from all SIASN apps. The app, utilizing ReactJS and Bootstrap, offers a user-friendly interface for efficiently checking the validity of documents.",
    "affiliation": "bkn",
    "platform": "Web",
    "tech_stack": "ReactJS, Bootstrap, JavaScript, HTML, CSS",
    "url": "https://valid-siasn.bkn.go.id/",
    "source_code": "",
    "year": "2022, 2023",
    "status": "Active",
    "logo": "",
    "file": "",
    "video": "",
    "youtube": ""
  },
  {
    "no": 10,
    "key": "siasn_idis_integrated_disiplin",
    "rank": 14,
    "name": "SIASN I'DIS (Integrated Disiplin)",
    "about_original": "A web app to report the indiscipline civil servant in Indonesia",
    "about": "A web app to report indiscipline civil servants in Indonesia.",
    "description": "SIASN I'DIS (Integrated Disiplin) is a web application developed by Badan Kepegawaian Negara (BKN) for reporting indiscipline among civil servants in Indonesia. The app, built with ReactJS, Tailwind CSS, and Keycloak, incorporates SWR for efficient data fetching and management, ensuring a responsive and effective platform for reporting and addressing disciplinary issues.",
    "affiliation": "bkn",
    "platform": "Web",
    "tech_stack": "ReactJS, Tailwind CSS, Keycloak, SWR, TypeScript, JavaScript, HTML, CSS",
    "url": "https://idis.bkn.go.id/",
    "source_code": "",
    "year": "2022, 2023",
    "status": "Active",
    "logo": "",
    "file": "",
    "video": "",
    "youtube": ""
  },
  {
    "no": 13,
    "key": "dashboard_sscasn",
    "rank": 15,
    "name": "Dashboard SSCASN",
    "about_original": "A web app to check and count the user who has registered to applied to be a civil servant",
    "about": "A web app to check and count the users who have registered to apply to be civil servants.",
    "description": "Dashboard SSCASN is a web application developed by Badan Kepegawaian Negara (BKN) to facilitate the checking and counting of users who have registered to apply for civil servant positions. The app, built using ReactJS, NextJS, and a tech stack including Ant Design and Tailwind CSS, ensures a user-friendly interface for efficient user management.",
    "affiliation": "bkn",
    "platform": "Web",
    "tech_stack": "ReactJS, NextJS, Ant Design, Tailwind CSS, KeyCloak, TypeScript, JavaScript, HTML, CSS",
    "url": "https://dashboard-sscasn.bkn.go.id/",
    "source_code": "",
    "year": "2023",
    "status": "Active",
    "logo": "",
    "file": "",
    "video": "",
    "youtube": ""
  },
  {
    "no": 7,
    "key": "siasn_bkn_kenaikan_pangkat",
    "rank": 16,
    "name": "SIASN BKN Kenaikan Pangkat",
    "about_original": "A web app for managing and processing incoming proposal data from another civil servant institution to ask for promotion",
    "about": "A web app for managing and processing incoming proposal data from another civil servant institution to ask for promotion.",
    "description": "SIASN BKN Kenaikan Pangkat is a web application developed by Badan Kepegawaian Negara (BKN) for efficiently managing and processing incoming proposal data related to promotions from another civil servant institution. The app, built using ReactJS, NextJS, and a tech stack including Ant Design and Redux, streamlines the process of handling promotion-related proposals.",
    "affiliation": "bkn",
    "platform": "Web",
    "tech_stack": "ReactJS, NextJS, Ant Design, Bootstrap, Redux, KeyCloak, TypeScript, JavaScript, HTML, CSS",
    "url": "https://kp-siasn.bkn.go.id/",
    "source_code": "",
    "year": "2022, 2023",
    "status": "Active",
    "logo": "",
    "file": "",
    "video": "",
    "youtube": ""
  },
  {
    "no": 8,
    "key": "siasn_bkn_peremajaan",
    "rank": 17,
    "name": "SIASN BKN Peremajaan",
    "about_original": "A web app for managing and processing incoming proposal data from another civil servant institution to update their data in database",
    "about": "A web app for managing and processing incoming proposal data from another civil servant institution to update their data in the database.",
    "description": "SIASN BKN Peremajaan is a web application developed by Badan Kepegawaian Negara (BKN) for efficiently managing and processing incoming proposal data related to data updates from another civil servant institution. The app, built using ReactJS, NextJS, and a tech stack including Ant Design and Redux, ensures a streamlined process for updating civil servant data in the database.",
    "affiliation": "bkn",
    "platform": "Web",
    "tech_stack": "ReactJS, NextJS, Ant Design, Bootstrap, Redux, KeyCloak, TypeScript, JavaScript, HTML, CSS",
    "url": "https://peremajaan-siasn.bkn.go.id/",
    "source_code": "",
    "year": "2022, 2023",
    "status": "Active",
    "logo": "",
    "file": "",
    "video": "",
    "youtube": ""
  },
  {
    "no": 6,
    "key": "siasn_bkn_pindah_instansi_mutasi",
    "rank": 18,
    "name": "SIASN BKN Pindah Instansi / Mutasi",
    "about_original": "A web app for managing and processing incoming proposal data from another civil servant institution to ask for mutation to another institution",
    "about": "A web app for managing and processing incoming proposal data from another civil servant institution to ask for mutation to another institution.",
    "description": "SIASN BKN Pindah Instansi / Mutasi is a web application developed by Badan Kepegawaian Negara (BKN) for efficiently managing and processing incoming proposal data related to mutations to another institution from another civil servant institution. The app, built using ReactJS, NextJS, and a tech stack including Ant Design and Redux, facilitates the process of handling mutation-related proposals.",
    "affiliation": "bkn",
    "platform": "Web",
    "tech_stack": "ReactJS, NextJS, Ant Design, Bootstrap, Redux, KeyCloak, TypeScript, JavaScript, HTML, CSS",
    "url": "https://mutasi-siasn.bkn.go.id/",
    "source_code": "",
    "year": "2022, 2023",
    "status": "Active",
    "logo": "",
    "file": "",
    "video": "",
    "youtube": ""
  },
  {
    "no": 46,
    "key": "rutilahu_app",
    "rank": 19,
    "name": "Rutilahu App",
    "about_original": "An android app to collected unlivable houses in Indonesia using crowd sourcing method",
    "about": "An android app to collect unlivable houses in Indonesia using crowd-sourcing methods.",
    "description": "Rutilahu App is an Android application developed by Institut Teknologi Nasional (ITENAS) Bandung for collecting information about unlivable houses in Indonesia through crowd-sourcing methods. The app utilizes Java, Mapbox SDK, XML, PHP, and MySQL to create a user-friendly platform for reporting and managing data related to unlivable houses.",
    "affiliation": "itenas",
    "platform": "Android",
    "tech_stack": "Java, Mapbox SDK, XML, PHP, MySQL",
    "url": "https://play.google.com/store/apps/details?id=com.lihatpeta.prototype&hl=en&gl=US",
    "source_code": "https://github.com/Alf-Anas/RutilahuApp",
    "year": "2019",
    "status": "Archived",
    "logo": "rutilahu_app.png",
    "file": "rutilahu_app.pdf",
    "video": "",
    "youtube": ""
  },
  {
    "no": 44,
    "key": "taswil_id",
    "rank": 20,
    "name": "Taswil.id",
    "about_original": "A web app to digitizing village boundary in Indonesia. This app is cancelled because of not enough man-power.",
    "about": "A web app for digitizing village boundaries in Indonesia. This app is canceled due to not enough manpower.",
    "description": "Taswil.id is a web application developed by PT. Pratama Persada Airborne for digitizing village boundaries in Indonesia. Unfortunately, the app has been canceled due to insufficient manpower. The app utilized Mapbox GL JS, TurfJS, LeafletJS, and a tech stack including Bootstrap, JavaScript, PHP, HTML, CSS, and MySQL for efficient digitization of village boundaries.",
    "affiliation": "ppa",
    "platform": "Web",
    "tech_stack": "Mapbox GL JS, TurfJS, LeafletJS, Bootstrap, JavaScript, PHP, HTML, CSS, MySQL",
    "url": "https://taswil.id",
    "source_code": "",
    "year": "2020",
    "status": "Failed",
    "logo": "taswil_id.png",
    "file": "",
    "video": "",
    "youtube": ""
  },
  {
    "no": 23,
    "key": "fuse_portal",
    "rank": 21,
    "name": "Fuse Portal",
    "about_original": "A platform for managing all cloud server from different cloud provider.",
    "about": "A platform for managing all cloud servers from different cloud providers.",
    "description": "Fuse Portal, developed by Skylab Cloud Technologies, is a comprehensive web-based platform designed for efficiently managing all cloud servers from different cloud providers. The platform leverages technologies such as ReactJS, NextJS, and Cloudscape Design, combined with Redux Saga, Lodash, and Husky for streamlined server management and coordination.",
    "affiliation": "skylab",
    "platform": "Web",
    "tech_stack": "ReactJS, NextJS, Cloudscape Design, Redux Saga, Lodash, Husky, JavaScript, TypeScript, HTML, CSS",
    "url": "",
    "source_code": "",
    "year": "2023",
    "status": "Completed",
    "logo": "",
    "file": "",
    "video": "",
    "youtube": ""
  },
  {
    "no": 16,
    "key": "sscasn_registrasi_admin",
    "rank": 22,
    "name": "SSCASN Registrasi Admin",
    "about_original": "A web app for registrating and managing new admin for SSCASN",
    "about": "A web app for registering and managing new admins for SSCASN.",
    "description": "SSCASN Registrasi Admin is a web application developed by Badan Kepegawaian Negara (BKN) for efficiently registering and managing new administrators for SSCASN. The app, built using ReactJS, NextJS, and a tech stack including Ant Design and Tailwind CSS, ensures a user-friendly interface for seamless admin registration and management.",
    "affiliation": "bkn",
    "platform": "Web",
    "tech_stack": "ReactJS, NextJS, Ant Design, Tailwind CSS, KeyCloak, TypeScript, JavaScript, HTML, CSS",
    "url": "https://regadmin-sscasn.bkn.go.id/",
    "source_code": "",
    "year": "2023",
    "status": "Active",
    "logo": "",
    "file": "",
    "video": "",
    "youtube": ""
  },
  {
    "no": 25,
    "key": "antara_suite",
    "rank": 23,
    "name": "Antara Suite",
    "about_original": "A multiplatform app for managing administration data of employee and other things related to human resources",
    "about": "A multiplatform app for managing administrative data of employees and other things related to human resources.",
    "description": "Antara Suite, developed by Skylab Cloud Technologies, is a versatile multiplatform application designed for managing administrative data of employees and other aspects related to human resources. The app supports platforms such as Mobile, Android, iOS, and Web, utilizing VueJS, NuxtJS, Material UI, Pinia, CapacitorJS, and a tech stack including JavaScript, TypeScript, HTML, and CSS for efficient data management across multiple platforms.",
    "affiliation": "skylab",
    "platform": "Mobile, Android, iOS, Web, Multiplatform",
    "tech_stack": "VueJS, NuxtJS, Material UI, Pinia, CapacitorJS, JavaScript, TypeScript, HTML, CSS",
    "url": "",
    "source_code": "",
    "year": "2022, 2023",
    "status": "Completed",
    "logo": "",
    "file": "",
    "video": "",
    "youtube": ""
  },
  {
    "no": 18,
    "key": "fusion_flow",
    "rank": 24,
    "name": "Fusion Flow",
    "about_original": "A platform for managing node from different cloud provider.",
    "about": "A platform for managing nodes from different cloud providers.",
    "description": "Fusion Flow, developed by Skylab Cloud Technologies, is a platform designed for efficiently managing nodes from different cloud providers. The web-based platform leverages technologies such as ReactJS, NextJS, Material UI, Redux Saga, and Lodash, combined with Husky for streamlined node management and coordination across various cloud environments.",
    "affiliation": "skylab",
    "platform": "Web",
    "tech_stack": "ReactJS, NextJS, Material UI, Redux Saga, Lodash, Husky, JavaScript, TypeScript, HTML, CSS",
    "url": "",
    "source_code": "",
    "year": "2022, 2023",
    "status": "Deprecated",
    "logo": "",
    "file": "",
    "video": "",
    "youtube": ""
  },
  {
    "no": 20,
    "key": "marketplace_buyer",
    "rank": 25,
    "name": "Marketplace Buyer",
    "about_original": "A platform from buyer to buy some services related to cloud provider",
    "about": "A platform for buyers to buy services related to cloud providers.",
    "description": "Marketplace Buyer, developed by Skylab Cloud Technologies, is a web-based platform designed for buyers to purchase services related to cloud providers. The platform leverages technologies such as ReactJS, NextJS, Material UI, Redux Saga, and Lodash, combined with Husky for a seamless and user-friendly experience in buying cloud services.",
    "affiliation": "skylab",
    "platform": "Web",
    "tech_stack": "ReactJS, NextJS, Material UI, Redux Saga, Lodash, Husky, JavaScript, TypeScript, HTML, CSS",
    "url": "",
    "source_code": "",
    "year": "2022, 2023",
    "status": "Completed",
    "logo": "",
    "file": "",
    "video": "",
    "youtube": ""
  },
  {
    "no": 21,
    "key": "marketplace_seller",
    "rank": 26,
    "name": "Marketplace Seller",
    "about_original": "A platform from seller to sell their services related to cloud provider",
    "about": "A platform for sellers to sell their services related to cloud providers.",
    "description": "Marketplace Seller, developed by Skylab Cloud Technologies, is a web-based platform designed for sellers to efficiently sell their services related to cloud providers. The platform leverages technologies such as ReactJS, NextJS, Material UI, Redux Saga, and Lodash, combined with Husky for a user-friendly and effective platform for selling cloud services.",
    "affiliation": "skylab",
    "platform": "Web",
    "tech_stack": "ReactJS, NextJS, Material UI, Redux Saga, Lodash, Husky, JavaScript, TypeScript, HTML, CSS",
    "url": "",
    "source_code": "",
    "year": "2022, 2023",
    "status": "Completed",
    "logo": "",
    "file": "",
    "video": "",
    "youtube": ""
  },
  {
    "no": 24,
    "key": "wso2_login_page",
    "rank": 27,
    "name": "WSO2 Login Page",
    "about_original": "A login page for SSO using WSO2 to login all the platform",
    "about": "A login page for SSO using WSO2 to log in to all platforms.",
    "description": "WSO2 Login Page, developed by Skylab Cloud Technologies, is a login page designed for Single Sign-On (SSO) using WSO2. The page provides a secure and efficient way to log in to various platforms. The login page is built using HTML and CSS for a simple yet effective user authentication experience.",
    "affiliation": "skylab",
    "platform": "Web",
    "tech_stack": "HTML, CSS",
    "url": "",
    "source_code": "",
    "year": "2022, 2023",
    "status": "Completed",
    "logo": "",
    "file": "",
    "video": "",
    "youtube": ""
  },
  {
    "no": 14,
    "key": "siasn_bkn_wasdal",
    "rank": 28,
    "name": "SIASN BKN Wasdal",
    "about_original": "A web app for checking incoming proposal data from another civil servant institution to supervised the incoming data",
    "about": "A web app for checking incoming proposal data from another civil servant institution to supervise the incoming data.",
    "description": "SIASN BKN Wasdal is a web application developed by Badan Kepegawaian Negara (BKN) for efficiently checking incoming proposal data from another civil servant institution. The app, built using ReactJS, NextJS, and a tech stack including Ant Design and Bootstrap, ensures a user-friendly interface for effective supervision of incoming data.",
    "affiliation": "bkn",
    "platform": "Web",
    "tech_stack": "ReactJS, NextJS, Ant Design, Bootstrap, KeyCloak, TypeScript, JavaScript, HTML, CSS",
    "url": "https://wasdal-siasn.bkn.go.id/",
    "source_code": "",
    "year": "2023",
    "status": "Active",
    "logo": "",
    "file": "",
    "video": "",
    "youtube": ""
  },
  {
    "no": 15,
    "key": "siasn_bkn_admin",
    "rank": 29,
    "name": "SIASN BKN Admin",
    "about_original": "A web app for managing the admin for other SIASN apps",
    "about": "A web app for managing the admin for other SIASN apps.",
    "description": "SIASN BKN Admin is a web application developed by Badan Kepegawaian Negara (BKN) for efficiently managing the admin roles for other SIASN apps. The app, built using ReactJS, NextJS, and a tech stack including Ant Design and Tailwind CSS, provides a user-friendly platform for seamless administration and management of other SIASN applications.",
    "affiliation": "bkn",
    "platform": "Web",
    "tech_stack": "ReactJS, NextJS, Ant Design, Tailwind CSS, KeyCloak, TypeScript, JavaScript, HTML, CSS",
    "url": "",
    "source_code": "",
    "year": "2023",
    "status": "Paused",
    "logo": "",
    "file": "",
    "video": "",
    "youtube": ""
  },
  {
    "no": 11,
    "key": "siasn_ssjpt",
    "rank": 30,
    "name": "SIASN SSJPT",
    "about_original": "A web app for creating and registering new position vacancy for structural level civil servant",
    "about": "A web app for creating and registering new position vacancies for structural level civil servants.",
    "description": "SIASN SSJPT is a web application developed by Badan Kepegawaian Negara (BKN) for efficiently creating and registering new position vacancies for structural level civil servants. The app, built using ReactJS, ViteJS, and a tech stack including Tailwind CSS and Keycloak, ensures a streamlined process for managing position vacancies.",
    "affiliation": "bkn",
    "platform": "Web",
    "tech_stack": "ReactJS, ViteJS, Tailwind CSS, SWR, Keycloak, TypeScript, JavaScript, HTML, CSS",
    "url": "",
    "source_code": "",
    "year": "2023",
    "status": "In Development",
    "logo": "",
    "file": "",
    "video": "",
    "youtube": ""
  },
  {
    "no": 12,
    "key": "siasn_jf",
    "rank": 31,
    "name": "SIASN JF",
    "about_original": "A web app for managing civil servant resources by providing some training",
    "about": "A web app for managing civil servant resources by providing some training.",
    "description": "SIASN JF is a web application developed by Badan Kepegawaian Negara (BKN) for efficiently managing civil servant resources by providing training. The app, built using ReactJS, ViteJS, and a tech stack including Tailwind CSS and Keycloak, offers a user-friendly platform for organizing and delivering training resources.",
    "affiliation": "bkn",
    "platform": "Web",
    "tech_stack": "ReactJS, ViteJS, Tailwind CSS, SWR, Keycloak, TypeScript, JavaScript, HTML, CSS",
    "url": "",
    "source_code": "",
    "year": "2023",
    "status": "In Development",
    "logo": "",
    "file": "",
    "video": "",
    "youtube": ""
  },
  {
    "no": 30,
    "key": "makan_apa_ya",
    "rank": 32,
    "name": "Makan Apa Ya?",
    "about_original": "An android app made using jetpack compose for #JuaraAndroid submission to give food recommendation",
    "about": "An android app made using Jetpack Compose for #JuaraAndroid submission to give food recommendations.",
    "description": "Makan Apa Ya? is an Android app developed using Kotlin and Jetpack Compose for the #JuaraAndroid submission. The app provides food recommendations, creating an engaging and visually appealing platform for users to discover new dining options.",
    "affiliation": "",
    "platform": "Android",
    "tech_stack": "Kotlin, Jetpack Compose",
    "url": "https://github.com/Alf-Anas/android-makan-apa-ya/releases/tag/MakanApaYaApp",
    "source_code": "https://github.com/Alf-Anas/android-makan-apa-ya",
    "year": "2023",
    "status": "Completed",
    "logo": "",
    "file": "",
    "video": "",
    "youtube": "https://youtu.be/UVAqrKSUD0s"
  },
  {
    "no": 31,
    "key": "global_sea_level",
    "rank": 33,
    "name": "Global Sea Level",
    "about_original": "A simple webgis app to visualize sea level rising.",
    "about": "A simple web GIS app to visualize sea level rising.",
    "description": "Global Sea Level is a simple web GIS app designed to visualize rising sea levels. The app utilizes Mapbox GL JS, TurfJS, and a tech stack including Bootstrap, JavaScript, HTML, and CSS to provide a clear and informative visualization of changes in sea levels.",
    "affiliation": "",
    "platform": "Web",
    "tech_stack": "Mapbox GL JS, TurfJS, Bootstrap, JavaScript, HTML, CSS",
    "url": "https://global-sea-level.geoit.dev/",
    "source_code": "https://github.com/Alf-Anas/global-sea-level",
    "year": "2021",
    "status": "Completed",
    "logo": "",
    "file": "",
    "video": "",
    "youtube": ""
  },
  {
    "no": 32,
    "key": "bisanya_kapan",
    "rank": 34,
    "name": "Bisanya Kapan?",
    "about_original": "A simple web app build in React JS and Firebase Realtime Database to create a voting app to decide when is the best time to do a gathering where all people have their free time.",
    "about": "A simple web app built in React JS and Firebase Realtime Database to create a voting app to decide when is the best time to do a gathering where all people have their free time.",
    "description": "Bisanya Kapan? is a simple web app developed in React JS and integrated with Firebase Realtime Database. The app serves as a voting platform to decide the best time for a gathering when all participants have their free time. With a user-friendly interface and technologies like ReactJS, Ant Design, and Bootstrap, the app simplifies the process of scheduling events.",
    "affiliation": "",
    "platform": "Web",
    "tech_stack": "ReactJS, Ant Design, Bootstrap, JavaScript, HTML, CSS, Firebase",
    "url": "https://bisanya-kapan.geoit.dev/",
    "source_code": "https://github.com/Alf-Anas/bisanya-kapan-react-app",
    "year": "2022",
    "status": "Completed",
    "logo": "",
    "file": "",
    "video": "",
    "youtube": ""
  },
  {
    "no": 22,
    "key": "fuse_admin",
    "rank": 35,
    "name": "Fuse Admin",
    "about_original": "A platform for managing all cloud server from different cloud provider.",
    "about": "A platform for managing all cloud servers from different cloud providers.",
    "description": "Fuse Admin, developed by Skylab Cloud Technologies, is a comprehensive web-based platform designed for efficiently managing all cloud servers from different cloud providers. The platform leverages technologies such as ReactJS, NextJS, and Cloudscape Design, combined with Redux Saga, Lodash, and Husky for streamlined server management and coordination.",
    "affiliation": "skylab",
    "platform": "Web",
    "tech_stack": "ReactJS, NextJS, Cloudscape Design, Redux Saga, Lodash, Husky, JavaScript, TypeScript, HTML, CSS",
    "url": "",
    "source_code": "",
    "year": "2023",
    "status": "Completed",
    "logo": "",
    "file": "",
    "video": "",
    "youtube": ""
  },
  {
    "no": 34,
    "key": "gdrive_list_app",
    "rank": 36,
    "name": "GDrive List App",
    "about_original": "A multiplatform app for converting files and folders json data to be like a file explorer",
    "about": "A multiplatform app for converting files and folders json data to be like a file explorer.",
    "description": "GDrive List App, developed by PT. Surveyor Indonesia, is a multiplatform app designed for converting files and folders JSON data into a file explorer-like format. The app supports Web, Android, and various platforms, utilizing technologies such as ReactJS, NextJS, CapacitorJS, Ant Design, and a tech stack including JavaScript, TypeScript, HTML, and CSS for efficient data conversion and exploration.",
    "affiliation": "ptsi",
    "platform": "Web, Android, Multiplatform",
    "tech_stack": "ReactJS, NextJS, CapacitorJS, Ant Design, JavaScript, TypeScript, HTML, CSS",
    "url": "",
    "source_code": "https://github.com/Alf-Anas/gdrive-list-app",
    "year": "2023",
    "status": "Completed",
    "logo": "",
    "file": "",
    "video": "",
    "youtube": ""
  },
  {
    "no": 39,
    "key": "alf_projext",
    "rank": 37,
    "name": "AlfProjext",
    "about_original": "A simple android app projects to earn money from android apps using ads or selling paid apps.",
    "about": "A simple android app projects to earn money from android apps using ads or selling paid apps.",
    "description": "AlfProjext is a straightforward Android app designed for individuals to undertake projects and earn money by creating Android apps with advertisements or by selling paid apps. The app is developed using Kotlin, Java, and XML, and integrates ad platforms such as Admob and AppLovin for monetization.",
    "affiliation": "",
    "platform": "Android",
    "tech_stack": "Kotlin, Java, XML, Admob, AppLovin",
    "url": "https://alfprojext.my.id/",
    "source_code": "",
    "year": "2022",
    "status": "Maintained",
    "logo": "alf_projext.gif",
    "file": "",
    "video": "",
    "youtube": ""
  },
  {
    "no": 82,
    "key": "map_layout_print_page",
    "rank": 38,
    "name": "Map Layout Print Page",
    "about_original": "A web app to generate layout of map to make it print ready in pdf format",
    "about": "A web app to generate the layout of the map to make it print-ready in PDF format.",
    "description": "Map Layout Print Page, developed in collaboration with Institut Teknologi Nasional (ITENAS) Bandung, is a web application designed for generating map layouts that are print-ready in PDF format. The app utilizes PHP, JavaScript, HTML, and CSS, along with Mapbox GL JS and LeafletJS, to provide a convenient platform for creating printable map layouts.",
    "affiliation": "itenas",
    "platform": "Web",
    "tech_stack": "PHP, JavaScript, HTML, CSS, Mapbox GL JS, LeafletJS",
    "url": "",
    "source_code": "",
    "year": "2019",
    "status": "Archived",
    "logo": "",
    "file": "",
    "video": "",
    "youtube": ""
  },
  {
    "no": 47,
    "key": "reimburse_app",
    "rank": 39,
    "name": "Reimburse App",
    "about_original": "An android financial records app for our internal use to records cash out while in the field project.",
    "about": "An android financial records app for our internal use to record cash out while in the field project.",
    "description": "Reimburse App is an Android app developed for internal use at PT. Surveyor Indonesia, serving as a financial records app to record cash transactions while in the field for projects. The app is built using Java and Kotlin, utilizing Room DB and SQLite for efficient data storage, along with XML, PHP, and MySQL for seamless financial record keeping.",
    "affiliation": "ptsi",
    "platform": "Android",
    "tech_stack": "Java, Kotlin, Room DB, SQLite, XML, PHP, MySQL",
    "url": "https://play.google.com/store/apps/details?id=dev.geoit.android.reimburseapppro",
    "source_code": "https://github.com/Alf-Anas/Reimburse-App-Pro",
    "year": "2020, 2021",
    "status": "Completed",
    "logo": "reimburse_app.png",
    "file": "reimburse_app.pdf",
    "video": "",
    "youtube": "https://youtu.be/oLvPKWrQBts"
  },
  {
    "no": 37,
    "key": "image_exif_to_csv",
    "rank": 40,
    "name": "Image EXIF to CSV",
    "about_original": "A simple web app to convert or extract metadata from photo/image files, and save it as .csv files.\nYou can convert/get image files GPS Corrdinate (latitude, longitude) from image metadata/properties, and save it as csv files.",
    "about": "A simple web app to convert or extract metadata from photo/image files and save it as .csv files. You can convert/get image files GPS Coordinate (latitude, longitude) from image metadata/properties and save it as CSV files.",
    "description": "Image EXIF to CSV is a simple web app developed by PT. Surveyor Indonesia for converting or extracting metadata from photo/image files and saving it as .csv files. The app supports the extraction of GPS coordinates (latitude, longitude) from image metadata/properties, providing a user-friendly interface and leveraging technologies such as ReactJS, Chakra UI, JavaScript, HTML, and CSS for efficient conversion and data management.",
    "affiliation": "ptsi",
    "platform": "Web",
    "tech_stack": "ReactJS, Chakra UI, JavaScript, HTML, CSS",
    "url": "https://image.geoit.dev/",
    "source_code": "https://github.com/Alf-Anas/image-props-app",
    "year": "2022",
    "status": "Completed",
    "logo": "",
    "file": "",
    "video": "",
    "youtube": ""
  },
  {
    "no": 38,
    "key": "write_sorry_100x",
    "rank": 41,
    "name": "Write \"Sorry\" 100x",
    "about_original": "A single page for fun to write \"Sorry\" 100 times",
    "about": "A single page for fun to write \"Sorry\" 100 times.",
    "description": "Write \"Sorry\" 100x is a single-page web application designed for fun, allowing users to write the word \"Sorry\" 100 times. The application, built using Bootstrap, JavaScript, HTML, and CSS, provides a lighthearted and entertaining experience for users.",
    "affiliation": "",
    "platform": "Web",
    "tech_stack": "Bootstrap, JavaScript, HTML, CSS",
    "url": "https://letter.geoit.dev/",
    "source_code": "https://github.com/Alf-Anas/Write-Sorry-100x",
    "year": "2022",
    "status": "Completed",
    "logo": "",
    "file": "",
    "video": "",
    "youtube": ""
  },
  {
    "no": 45,
    "key": "desaku",
    "rank": 42,
    "name": "Desaku",
    "about_original": "An android app to digitizing village boundary in Indonesia. This app is cancelled because of not enough man-power.",
    "about": "An android app to digitize village boundaries in Indonesia. This app is canceled due to not enough manpower.",
    "description": "Desaku is an Android app developed by PT. Pratama Persada Airborne for digitizing village boundaries in Indonesia. Unfortunately, the app was canceled due to insufficient manpower. The app, built using Java and integrating Mapbox SDK, XML, PHP, and MySQL, aimed to contribute to the digitization of village boundaries.",
    "affiliation": "ppa",
    "platform": "Android",
    "tech_stack": "Java, Mapbox SDK, XML, PHP, MySQL",
    "url": "",
    "source_code": "",
    "year": "2020",
    "status": "Failed",
    "logo": "taswil_id.png",
    "file": "",
    "video": "",
    "youtube": ""
  },
  {
    "no": 43,
    "key": "dapil_dki_jakarta",
    "rank": 43,
    "name": "Dapil DKI Jakarta",
    "about_original": "A web app for show and analyzing political data in Jakarta",
    "about": "A web app to show and analyze political data in Jakarta.",
    "description": "Dapil DKI Jakarta is a web application designed to show and analyze political data in Jakarta. The app utilizes Mapbox GL JS, TurfJS, Bootstrap, and a tech stack including JavaScript, HTML, and CSS to provide an informative and visually appealing platform for understanding political data in the Jakarta region.",
    "affiliation": "",
    "platform": "Web",
    "tech_stack": "Mapbox GL JS, TurfJS, Bootstrap, JavaScript, HTML, CSS",
    "url": "",
    "source_code": "",
    "year": "2021",
    "status": "Deprecated",
    "logo": "dapil_dki_jakarta.png",
    "file": "dapil_dki_jakarta.pdf",
    "video": "",
    "youtube": ""
  },
  {
    "no": 49,
    "key": "ciber_probowangi_ii",
    "rank": 44,
    "name": "Ciber Probowangi II",
    "about_original": "A dekstop app made using Visual Basic for project probowangi toll road data input with GIS functionality.",
    "about": "A desktop app made using Visual Basic for project probowangi toll road data input with GIS functionality.",
    "description": "Ciber Probowangi II is a desktop application developed using Visual Basic for project Probowangi toll road data input with GIS functionality. The app, affiliated with PT. Surveyor Indonesia, leverages Visual Basic, DotSpatial, and Microsoft Access to provide a comprehensive desktop platform for GIS-related data input in the context of the Probowangi toll road project.",
    "affiliation": "ptsi",
    "platform": "Windows",
    "tech_stack": "Visual Basic, DotSpatial, Microsoft Access",
    "url": "",
    "source_code": "",
    "year": "2019, 2020",
    "status": "Archived",
    "logo": "ciber_probowangi_ii.png",
    "file": "ciber_probowangi_ii.pdf",
    "video": "",
    "youtube": ""
  },
  {
    "no": 50,
    "key": "lofrus_local_forum_discussion",
    "rank": 45,
    "name": "Lofrus (Local Forum DIscussion)",
    "about_original": "Share and discuss everything around you. My startup idea, but in hold on for a while because my lack of skill.",
    "about": "Share and discuss everything around you. My startup idea, but on hold for a while because of my lack of skill.",
    "description": "Lofrus is an Android app designed for local forum discussions, allowing users to share and discuss everything around them. Conceived as a startup idea, the project is currently on hold due to the developer's temporary lack of skill. The app is built using Kotlin, XML, and integrates the Mapbox SDK for enhanced mapping capabilities.",
    "affiliation": "",
    "platform": "Android",
    "tech_stack": "Kotlin, XML, Mapbox SDK",
    "url": "https://lofrus.com/",
    "source_code": "",
    "year": "2020, 2021",
    "status": "Failed",
    "logo": "lofrus_local_forum_discussion.png",
    "file": "lofrus_local_forum_discussion.pdf",
    "video": "",
    "youtube": ""
  },
  {
    "no": 51,
    "key": "lofrus_rest_api",
    "rank": 46,
    "name": "Lofrus REST API",
    "about_original": "A REST API for Lofrus App made using laravel",
    "about": "A REST API for Lofrus App made using Laravel.",
    "description": "Lofrus REST API is a server-side application serving as the backend for the Lofrus App. Developed using Laravel, PHP, and MySQL, the REST API facilitates seamless communication between the Lofrus App and the server, ensuring efficient data processing and retrieval for a smooth user experience.",
    "affiliation": "",
    "platform": "Server",
    "tech_stack": "Laravel, PHP, MySQL",
    "url": "",
    "source_code": "",
    "year": "2020, 2021",
    "status": "Failed",
    "logo": "",
    "file": "",
    "video": "",
    "youtube": ""
  },
  {
    "no": 52,
    "key": "petafora",
    "rank": 47,
    "name": "Petafora",
    "about_original": "My startup Idea to create a forum app to share everything around you",
    "about": "My startup idea to create a forum app to share everything around you.",
    "description": "Petafora is an Android app conceived as a startup idea to create a forum platform for users to share everything around them. Developed using Java, XML, and integrating Mapbox SDK, the app offers an interactive and engaging forum experience. Additionally, PHP and MySQL are employed for efficient data management and retrieval.",
    "affiliation": "",
    "platform": "Android",
    "tech_stack": "Java, XML, Mapbox SDK, PHP, MySQL",
    "url": "https://petafora.com/",
    "source_code": "",
    "year": "2019, 2020",
    "status": "Failed",
    "logo": "",
    "file": "",
    "video": "",
    "youtube": ""
  },
  {
    "no": 53,
    "key": "db_proyek",
    "rank": 48,
    "name": "DB Proyek",
    "about_original": "An android app to check and search existing or running project in our division",
    "about": "An android app to check and search existing or running projects in our division.",
    "description": "DB Proyek is an Android app developed for PT. Surveyor Indonesia, providing functionality to check and search existing or running projects within the division. The app, built using Java, SQLite, and XML, offers a convenient platform for project management and information retrieval.",
    "affiliation": "ptsi",
    "platform": "Android",
    "tech_stack": "Java, SQLite, XML",
    "url": "",
    "source_code": "https://github.com/Alf-Anas/DB_Proyek",
    "year": "2020",
    "status": "Archived",
    "logo": "",
    "file": "",
    "video": "",
    "youtube": ""
  },
  {
    "no": 57,
    "key": "progress_probowangi",
    "rank": 49,
    "name": "Progress Probowangi",
    "about_original": "A webgis for monitoring project probowangi toll road progress.",
    "about": "A web GIS for monitoring the progress of the Probowangi toll road project.",
    "description": "Progress Probowangi is a web GIS application developed by PT. Surveyor Indonesia for monitoring the progress of the Probowangi toll road project. The app utilizes Mapbox GL JS, Bootstrap, and a tech stack including PHP, JavaScript, HTML, and CSS to provide a comprehensive and visually appealing platform for tracking project advancements.",
    "affiliation": "ptsi",
    "platform": "Web",
    "tech_stack": "Mapbox GL JS, Bootstrap, PHP, JavaScript, HTML, CSS",
    "url": "",
    "source_code": "",
    "year": "2020",
    "status": "Archived",
    "logo": "",
    "file": "progress_probowangi.pdf",
    "video": "",
    "youtube": ""
  },
  {
    "no": 77,
    "key": "wind_direction_camera_survey_app",
    "rank": 50,
    "name": "Wind Direction Camera Survey (WDCS) App",
    "about_original": "An android app for land surveying POI data with 5 direction photos.",
    "about": "An android app for land surveying POI data with 5 direction photos.",
    "description": "Wind Direction Camera Survey (WDCS) App is an Android application developed by PT. Pratama Persada Airborne for land surveying POI data with 5 direction photos. The app, built using Java and XML, integrates Mapbox SDK, SQLite, PHP, and MySQL for efficient data collection and management during land surveys.",
    "affiliation": "ppa",
    "platform": "Android",
    "tech_stack": "Java, XML, Mapbox SDK, SQLite, PHP, MySQL",
    "url": "",
    "source_code": "",
    "year": "2020",
    "status": "Archived",
    "logo": "wind_direction_camera_survey_app.png",
    "file": "wind_direction_camera_survey_app.pdf",
    "video": "",
    "youtube": ""
  },
  {
    "no": 76,
    "key": "sauce_demo_selenium_cucumber",
    "rank": 51,
    "name": "SauceDemo Selenium Cucumber",
    "about_original": "An automation test for SauceDemo web app made using cucumber and selenium",
    "about": "An automation test for the SauceDemo web app made using cucumber and selenium.",
    "description": "SauceDemo Selenium Cucumber is an automation test suite designed for the SauceDemo web app. Developed for Windows and scripted for automation, the test suite utilizes Java, Cucumber, Selenium, and JUnit for systematic and reliable testing of the SauceDemo web application.",
    "affiliation": "",
    "platform": "Windows, Script, Automation",
    "tech_stack": "Java, Cucumber, Selenium, JUnit",
    "url": "",
    "source_code": "https://github.com/Alf-Anas/QA-Selenium-Cucumber",
    "year": "2023",
    "status": "Completed",
    "logo": "",
    "file": "",
    "video": "",
    "youtube": ""
  },
  {
    "no": 48,
    "key": "laskar_merah_putih_app",
    "rank": 52,
    "name": "Laskar Merah Putih App",
    "about_original": "An android app to record membership data of our organization.",
    "about": "An android app to record membership data of our organization.",
    "description": "Laskar Merah Putih App is an Android application developed for recording membership data of an organization. The app, built using Java and Kotlin, incorporates Room DB, SQLite, XML, and PHP for efficient data management and retrieval, providing a user-friendly platform for maintaining membership records.",
    "affiliation": "",
    "platform": "Android",
    "tech_stack": "Java, Kotlin, Room DB, SQLite, XML, PHP",
    "url": "",
    "source_code": "",
    "year": "2020",
    "status": "Archived",
    "logo": "laskar_merah_putih_app.png",
    "file": "laskar_merah_putih_app",
    "video": "",
    "youtube": ""
  },
  {
    "no": 36,
    "key": "kpu_download",
    "rank": 53,
    "name": "KPU Download",
    "about_original": "A script for scraping and downloading president vote data of Indonesia in 2019",
    "about": "A script for scraping and downloading presidential vote data of Indonesia in 2019.",
    "description": "KPU Download is a script designed for scraping and downloading presidential vote data of Indonesia in 2019. Developed for the web and scripted for automation, the script leverages technologies such as Bootstrap, PHP, JavaScript, HTML, and CSS for efficient data extraction and downloading.",
    "affiliation": "",
    "platform": "Web, Script, Automation",
    "tech_stack": "Bootstrap, PHP, JavaScript, HTML, CSS",
    "url": "",
    "source_code": "",
    "year": "2021",
    "status": "Archived",
    "logo": "",
    "file": "",
    "video": "",
    "youtube": ""
  },
  {
    "no": 35,
    "key": "map_3d_dem_view",
    "rank": 54,
    "name": "Map 3D DEM View",
    "about_original": "A simpel web gis to show 3D model in DEM in web format",
    "about": "A simple web GIS to show 3D models in DEM in web format.",
    "description": "Map 3D DEM View is a simple web GIS application developed by PT. Surveyor Indonesia to showcase 3D models in Digital Elevation Model (DEM) format on the web. The app utilizes Mapbox GL JS, TurfJS, Bootstrap, and a tech stack including JavaScript, HTML, and CSS to provide an interactive and informative 3D viewing experience.",
    "affiliation": "ptsi",
    "platform": "Web",
    "tech_stack": "Mapbox GL JS, TurfJS, Bootstrap, JavaScript, HTML, CSS",
    "url": "",
    "source_code": "",
    "year": "2022",
    "status": "Archived",
    "logo": "",
    "file": "",
    "video": "",
    "youtube": ""
  },
  {
    "no": 40,
    "key": "kebumian_id",
    "rank": 55,
    "name": "Kebumian.id",
    "about_original": "It supposed to be a personal blog for sharing about \"earth\" thing, GIS, or Civil, but I make it in forum format so other people can join and post something.",
    "about": "It was supposed to be a personal blog for sharing about \"earth\" things, GIS, or Civil, but I made it in forum format so other people can join and post something.",
    "description": "Kebumian.id was initially conceived as a personal blog for sharing information about earth-related topics, GIS, or Civil matters. However, it was developed in forum format to allow other people to join and post content. The platform is built using Flarum and integrates Amazon S3 for efficient data storage and retrieval.",
    "affiliation": "",
    "platform": "Web",
    "tech_stack": "Flarum, Amazon S3",
    "url": "https://www.kebumian.id/",
    "source_code": "",
    "year": "2022",
    "status": "Failed",
    "logo": "kebumian_id.png",
    "file": "",
    "video": "",
    "youtube": ""
  },
  {
    "no": 41,
    "key": "tutorial_hidup",
    "rank": 56,
    "name": "Tutorial Hidup",
    "about_original": "An Internet Forum for sharing about life (Indonesian Only). The purpose of this forum is to make an archive about how people living their life and how they overcome it to be used as a reference for the next generation so as not to make the same mistake and choose a better path of life without any regrets.",
    "about": "An Internet Forum for sharing about life (Indonesian Only). The purpose of this forum is to create an archive about how people live their lives and how they overcome challenges, serving as a reference for the next generation to choose a better path of life without regrets.",
    "description": "Tutorial Hidup is an Internet Forum designed for sharing about life, specifically catering to an Indonesian audience. The forum's purpose is to create an archive documenting how people live their lives, overcome challenges, and serve as a reference for the next generation in choosing a better path of life without regrets. The platform is developed using Flarum and integrates Amazon S3 for efficient data storage.",
    "affiliation": "",
    "platform": "Web",
    "tech_stack": "Flarum, Amazon S3",
    "url": "https://www.tutorialhidup.id/",
    "source_code": "",
    "year": "2022",
    "status": "Failed",
    "logo": "tutorial_hidup.png",
    "file": "",
    "video": "",
    "youtube": ""
  },
  {
    "no": 42,
    "key": "life_tutorial",
    "rank": 57,
    "name": "Life Tutorial",
    "about_original": "An Internet Forum for sharing about life (Global Audience). The purpose of this forum is to make an archive about how people living their life and how they overcome it to be used as a reference for the next generation so as not to make the same mistake and choose a better path of life without any regrets.",
    "about": "An Internet Forum for sharing about life (Global Audience). The purpose of this forum is to create an archive about how people live their lives and how they overcome challenges, serving as a reference for the next generation to choose a better path of life without regrets.",
    "description": "Life Tutorial is an Internet Forum designed for sharing about life, targeting a global audience. The forum serves the purpose of creating an archive documenting how people live their lives and overcome challenges, acting as a reference for the next generation to choose a better path of life without regrets. The platform is developed using Flarum and integrates Amazon S3 for efficient data storage.",
    "affiliation": "",
    "platform": "Web",
    "tech_stack": "Flarum, Amazon S3",
    "url": "https://www.lifetutorial.net/",
    "source_code": "",
    "year": "2022",
    "status": "Failed",
    "logo": "life_tutorial.png",
    "file": "",
    "video": "",
    "youtube": ""
  },
  {
    "no": 54,
    "key": "github_user_app",
    "rank": 58,
    "name": "Github User App",
    "about_original": "An android app to search github user using github API",
    "about": "An android app to search GitHub users using the GitHub API.",
    "description": "Github User App is an Android application developed for searching GitHub users using the GitHub API. The app, built using Kotlin, integrates Room DB, SQLite, and XML for efficient data management and retrieval, providing users with a convenient platform for exploring and discovering GitHub profiles.",
    "affiliation": "",
    "platform": "Android",
    "tech_stack": "Kotlin, Room DB, SQLite, XML",
    "url": "",
    "source_code": "https://github.com/Alf-Anas/Github-User-App-V.3",
    "year": "2021",
    "status": "Archived",
    "logo": "",
    "file": "",
    "video": "",
    "youtube": ""
  },
  {
    "no": 55,
    "key": "clicklick",
    "rank": 59,
    "name": "Clicklick",
    "about_original": "An android game to tap the object in the screen and increase focus",
    "about": "An android game to tap objects on the screen and increase focus.",
    "description": "Clicklick is an Android game designed to enhance focus by challenging users to tap objects on the screen. The game, built using Java and XML, incorporates Admob for monetization, providing an engaging and interactive experience for users aiming to improve their concentration and tapping skills.",
    "affiliation": "",
    "platform": "Android, Game",
    "tech_stack": "Java, XML, Admob",
    "url": "",
    "source_code": "",
    "year": "2016",
    "status": "Archived",
    "logo": "",
    "file": "",
    "video": "",
    "youtube": ""
  },
  {
    "no": 56,
    "key": "the_onion_hunter",
    "rank": 60,
    "name": "The Onion Hunter",
    "about_original": "A flash game to tap the onion or celebi on the screen",
    "about": "A flash game to tap the onion or Celebi on the screen.",
    "description": "The Onion Hunter is a Windows flash game designed for users to tap either the onion or Celebi on the screen. The game utilizes Flash and ActionScript to create an engaging and interactive experience, challenging players to test their reflexes and accuracy.",
    "affiliation": "",
    "platform": "Windows, Game",
    "tech_stack": "Flash, ActionScript",
    "url": "",
    "source_code": "",
    "year": "2014",
    "status": "Archived",
    "logo": "",
    "file": "",
    "video": "",
    "youtube": ""
  },
  {
    "no": 58,
    "key": "the_movie_db_app",
    "rank": 61,
    "name": "The Movie DB App",
    "about_original": "An android app to check and search about movie and series using TMDB API",
    "about": "An android app to check and search about movies and series using TMDB API.",
    "description": "The Movie DB App is an Android application designed for checking and searching information about movies and series using the TMDB API. Built with Kotlin, XML, SQLite, and Room DB, the app provides users with a comprehensive platform to explore and discover details about their favorite movies and TV series.",
    "affiliation": "",
    "platform": "Android",
    "tech_stack": "Kotlin, XML, SQLite, Room DB",
    "url": "",
    "source_code": "https://github.com/Alf-Anas/TheMovieDB",
    "year": "2021",
    "status": "Archived",
    "logo": "",
    "file": "",
    "video": "",
    "youtube": ""
  },
  {
    "no": 59,
    "key": "wisata_app",
    "rank": 62,
    "name": "Wisata App",
    "about_original": "A flutter app to show a tourist spot in Bandung Area",
    "about": "A Flutter app to show tourist spots in the Bandung Area.",
    "description": "Wisata App is a multiplatform application, developed using Flutter and Dart, to showcase tourist spots in the Bandung Area. The app is designed for Android and web platforms, offering users an immersive and informative experience as they explore various tourist attractions in the specified region.",
    "affiliation": "",
    "platform": "Android, Web, Multiplatform",
    "tech_stack": "Flutter, Dart",
    "url": "",
    "source_code": "https://github.com/Alf-Anas/Wisata_App_Flutter",
    "year": "2021",
    "status": "Archived",
    "logo": "",
    "file": "",
    "video": "",
    "youtube": ""
  },
  {
    "no": 60,
    "key": "nusantara_app",
    "rank": 63,
    "name": "Nusantara App",
    "about_original": "An android app for learning purpose, creating Indonesia Map with it's provincial detail information.",
    "about": "An android app for learning purposes, creating an Indonesia Map with its provincial detailed information.",
    "description": "Nusantara App is an Android application developed for learning purposes, allowing users to create an Indonesia Map with detailed information about its provinces. The app leverages Mapbox SDK, Kotlin, and XML to provide users with a hands-on learning experience in geography and map development.",
    "affiliation": "",
    "platform": "Android",
    "tech_stack": "Mapbox SDK, Kotlin, XML",
    "url": "",
    "source_code": "",
    "year": "2020",
    "status": "Archived",
    "logo": "nusantara_app.png",
    "file": "nusantara_app.pdf",
    "video": "",
    "youtube": ""
  },
  {
    "no": 61,
    "key": "nusantara_app_flutter",
    "rank": 64,
    "name": "Nusantara App Flutter",
    "about_original": "An app built using flutter for learning purpose, creating Indonesia Map with it's provincial detail information.",
    "about": "An app built using Flutter for learning purposes, creating an Indonesia Map with its provincial detailed information.",
    "description": "Nusantara App Flutter is a multiplatform application developed for learning purposes, built using Flutter and Dart. The app allows users to create an Indonesia Map with detailed information about its provinces, utilizing Mapbox GL for enhanced map functionality across Android, web, and other platforms.",
    "affiliation": "",
    "platform": "Android, Web, Multiplatform",
    "tech_stack": "Flutter, Dart, Mapbox GL",
    "url": "",
    "source_code": "https://github.com/Alf-Anas/flutter_nusantara_app",
    "year": "2021",
    "status": "Archived",
    "logo": "nusantara_app.png",
    "file": "",
    "video": "",
    "youtube": ""
  },
  {
    "no": 62,
    "key": "movie_catalogue",
    "rank": 65,
    "name": "Movie Catalogue",
    "about_original": "A web app to check and search about movie and series using TMDB API",
    "about": "A web app to check and search about movies and series using TMDB API.",
    "description": "Movie Catalogue is a Progressive Web App (PWA) designed for checking and searching information about movies and series using the TMDB API. The web app, built with JavaScript, HTML, CSS, and OpenDB, offers users a seamless and responsive experience as they explore and discover details about various films and TV shows.",
    "affiliation": "",
    "platform": "PWA, Web",
    "tech_stack": "JavaScript, HTML, CSS, OpenDB",
    "url": "",
    "source_code": "https://github.com/Alf-Anas/PWA-DCD-Movie",
    "year": "2021",
    "status": "Archived",
    "logo": "",
    "file": "",
    "video": "",
    "youtube": ""
  },
  {
    "no": 63,
    "key": "restaurant_app",
    "rank": 66,
    "name": "Restaurant App",
    "about_original": "A flutter app to check restaurant near you",
    "about": "A Flutter app to check restaurants near you.",
    "description": "Restaurant App is a multiplatform Flutter application designed for checking restaurants near the user. The app is developed for Android, web, and other platforms, offering users a convenient and interactive platform to discover and explore nearby restaurants. SQLite is integrated for efficient data management.",
    "affiliation": "",
    "platform": "Android, Web, Multiplatform",
    "tech_stack": "Flutter, Dart, SQLite",
    "url": "",
    "source_code": "https://github.com/Alf-Anas/Flutter_Restaurant_App",
    "year": "2021",
    "status": "Archived",
    "logo": "",
    "file": "",
    "video": "",
    "youtube": ""
  },
  {
    "no": 64,
    "key": "profile_tanah_3d",
    "rank": 67,
    "name": "Profile Tanah 3D",
    "about_original": "A simpel web gis to show 3D building model in web format",
    "about": "A simple web GIS app to show 3D building models in web format.",
    "description": "Profile Tanah 3D is a web GIS application developed by PT. Surveyor Indonesia to showcase 3D building models in web format. The app utilizes Mapbox GL JS, JavaScript, HTML, and CSS to provide users with an informative and visually appealing experience as they explore and analyze 3D building structures.",
    "affiliation": "ptsi",
    "platform": "Web",
    "tech_stack": "Mapbox GL JS, JavaScript, HTML, CSS",
    "url": "",
    "source_code": "",
    "year": "2021",
    "status": "Archived",
    "logo": "",
    "file": "",
    "video": "",
    "youtube": ""
  },
  {
    "no": 65,
    "key": "download_movie_posters",
    "rank": 68,
    "name": "Download Movie Posters",
    "about_original": "An android app to download movie poster and set it as a phone wallpaper",
    "about": "An android app to download movie posters and set them as phone wallpapers.",
    "description": "Download Movie Posters is an Android application designed for downloading movie posters and setting them as phone wallpapers. The app, built with Kotlin and XML, integrates Admob and AppLovin for monetization, providing users with a convenient platform to personalize their devices with their favorite movie posters.",
    "affiliation": "",
    "platform": "Android",
    "tech_stack": "Kotlin, XML, Admob, AppLovin",
    "url": "https://play.google.com/store/apps/details?id=dev.geoit.wallpaper.tmdb",
    "source_code": "",
    "year": "2022",
    "status": "Completed",
    "logo": "",
    "file": "",
    "video": "",
    "youtube": ""
  },
  {
    "no": 66,
    "key": "story_app",
    "rank": 69,
    "name": "Story App",
    "about_original": "An android app to make a story app based on your location",
    "about": "An android app to create a story app based on your location.",
    "description": "Story App is an Android application designed for creating a story app based on the user's location. Developed using Kotlin and XML, the app integrates Google Maps for location-based storytelling, providing users with a unique and personalized experience as they explore and contribute to location-specific stories.",
    "affiliation": "",
    "platform": "Android",
    "tech_stack": "Kotlin, XML, Google Maps, ",
    "url": "",
    "source_code": "https://github.com/Alf-Anas/StoryApp",
    "year": "2022",
    "status": "Archived",
    "logo": "",
    "file": "",
    "video": "",
    "youtube": ""
  },
  {
    "no": 67,
    "key": "mini_kanban",
    "rank": 70,
    "name": "Mini Kanban",
    "about_original": "A web app for managing task in kanban board mode",
    "about": "A web app for managing tasks in kanban board mode.",
    "description": "Mini Kanban is a web application designed for managing tasks in kanban board mode. Built with ReactJS, JavaScript, HTML, and CSS, the app offers users a visual and organized platform for task management, allowing them to efficiently track and progress through their work in a kanban-style interface.",
    "affiliation": "",
    "platform": "Web",
    "tech_stack": "ReactJS, JavaScript, HTML, CSS",
    "url": "https://mini-kanban.vercel.app/",
    "source_code": "https://github.com/Alf-Anas/mini-kanban",
    "year": "2022",
    "status": "Completed",
    "logo": "",
    "file": "",
    "video": "",
    "youtube": ""
  },
  {
    "no": 68,
    "key": "github_user_search",
    "rank": 71,
    "name": "Github User Search",
    "about_original": "A web app to search github user using github API",
    "about": "A web app to search GitHub users using the GitHub API.",
    "description": "Github User Search is a web application designed for searching GitHub users using the GitHub API. Developed with ReactJS, Ant Design, JavaScript, TypeScript, HTML, and CSS, the app provides users with a user-friendly platform to explore and discover GitHub profiles efficiently and effectively.",
    "affiliation": "",
    "platform": "Web",
    "tech_stack": "ReactJS, Ant Design, JavaScript, TypeScript, HTML, CSS",
    "url": "https://react-github-user-search-app.web.app/",
    "source_code": "https://github.com/Alf-Anas/react-github-user-search",
    "year": "2023",
    "status": "Completed",
    "logo": "",
    "file": "",
    "video": "",
    "youtube": ""
  },
  {
    "no": 69,
    "key": "car_map",
    "rank": 72,
    "name": "Car Map",
    "about_original": "A simple web gis app to test the functionality of leaflet and moving a car",
    "about": "A simple web GIS app to test the functionality of leaflet and simulate moving a car.",
    "description": "Car Map is a simple web GIS application developed to test the functionality of leaflet and simulate moving a car. The app, built with LeafletJS, JavaScript, HTML, and CSS, serves as an experimental platform to assess and demonstrate the capabilities of leaflet in a web GIS context.",
    "affiliation": "",
    "platform": "Web",
    "tech_stack": "LeafletJS, JavaScript, HTML, CSS",
    "url": "https://alf-anas.github.io/test-leaflet-car-map/",
    "source_code": "https://github.com/Alf-Anas/test-leaflet-car-map",
    "year": "2022",
    "status": "Completed",
    "logo": "",
    "file": "",
    "video": "",
    "youtube": ""
  },
  {
    "no": 70,
    "key": "pokedex",
    "rank": 73,
    "name": "Pokedex",
    "about_original": "A web app for searching and show the data of pokemon",
    "about": "A web app for searching and showing the data of Pokmon.",
    "description": "Pokedex is a web application designed for searching and displaying data of Pokmon. Built with ReactJS, NextJS, Ant Design, JavaScript, TypeScript, HTML, and CSS, the app provides users with a comprehensive platform to explore and learn about various Pokmon characters efficiently.",
    "affiliation": "",
    "platform": "Web",
    "tech_stack": "ReactJS, NextJS, Ant Design, JavaScript, TypeScript, HTML, CSS",
    "url": "https://alf-anas.github.io/nextjs-pokedex/",
    "source_code": "https://github.com/Alf-Anas/nextjs-pokedex",
    "year": "2023",
    "status": "Completed",
    "logo": "",
    "file": "",
    "video": "",
    "youtube": ""
  },
  {
    "no": 71,
    "key": "thin_marketplace",
    "rank": 74,
    "name": "Thin Marketplace",
    "about_original": "A simple web app to test the fucntionality of Thin Backend",
    "about": "A simple web app to test the functionality of Thin Backend.",
    "description": "Thin Marketplace is a simple web application developed to test the functionality of Thin Backend. Built with ReactJS, NextJS, Ant Design, Thin Backend, JavaScript, TypeScript, HTML, and CSS, the app serves as an experimental platform to evaluate and demonstrate the capabilities of Thin Backend in a web context.",
    "affiliation": "",
    "platform": "Web",
    "tech_stack": "ReactJS, NextJS, Ant Design, Thin Backend, JavaScript, TypeScript, HTML, CSS",
    "url": "https://thin-marketplace.vercel.app/",
    "source_code": "https://github.com/Alf-Anas/nextjs-thin-be",
    "year": "2023",
    "status": "Completed",
    "logo": "",
    "file": "",
    "video": "",
    "youtube": ""
  },
  {
    "no": 72,
    "key": "cats",
    "rank": 75,
    "name": "Cats",
    "about_original": "A test app made using NuxtJS to show cats data using Cats API",
    "about": "A test app made using NuxtJS to show cat data using Cats API.",
    "description": "Cats is a test application developed using NuxtJS to showcase cat data using the Cats API. The app, built with VueJS, NuxtJS, Pinia, Tailwind CSS, JavaScript, TypeScript, HTML, and CSS, serves as an experimental platform to explore and understand the integration of different technologies in a web context.",
    "affiliation": "",
    "platform": "Web",
    "tech_stack": "VueJS, NuxtJS, Pinia, Tailwind CSS, JavaScipt, TypeScript, HTML, CSS",
    "url": "https://nuxtjs-cat.vercel.app/",
    "source_code": "https://github.com/Alf-Anas/nuxtjs-cat",
    "year": "2023",
    "status": "Completed",
    "logo": "",
    "file": "",
    "video": "",
    "youtube": ""
  },
  {
    "no": 73,
    "key": "ship_routing",
    "rank": 76,
    "name": "Ship Routing",
    "about_original": "A test app for check the ship routing and time using Ship API",
    "about": "A test app to check ship routing and time using Ship API.",
    "description": "Ship Routing is a test application developed to check ship routing and time using the Ship API. Built with ReactJS, NextJS, Ant Design, MapLibre, JavaScript, TypeScript, HTML, and CSS, the app serves as an experimental platform to assess and demonstrate the capabilities of the Ship API in a web context.",
    "affiliation": "",
    "platform": "Web",
    "tech_stack": "ReactJS, NextJS, Ant Design, MapLibre, JavaScript, TypeScript, HTML, CSS",
    "url": "https://ship-routing-nextjs.vercel.app/",
    "source_code": "https://github.com/Alf-Anas/ship-routing-nextjs",
    "year": "2023",
    "status": "Completed",
    "logo": "",
    "file": "",
    "video": "",
    "youtube": ""
  },
  {
    "no": 74,
    "key": "raja_ongkir",
    "rank": 77,
    "name": "Raja Ongkir",
    "about_original": "A test app for check the cost and time using Raja Ongkir API",
    "about": "A test app to check the cost and time using Raja Ongkir API.",
    "description": "Raja Ongkir is a test application developed to check the cost and time using the Raja Ongkir API. Built with ReactJS, NextJS, Tailwind CSS, JavaScript, TypeScript, HTML, and CSS, the app serves as an experimental platform to assess and demonstrate the capabilities of the Raja Ongkir API in a web context.",
    "affiliation": "",
    "platform": "Web",
    "tech_stack": "ReactJS, NextJS, Tailwind CSS, JavaScript, TypeScript, HTML, CSS",
    "url": "https://nextjs-raja-ongkir.vercel.app/",
    "source_code": "https://github.com/Alf-Anas/nextjs-raja-ongkir",
    "year": "2023",
    "status": "Completed",
    "logo": "",
    "file": "",
    "video": "",
    "youtube": ""
  },
  {
    "no": 75,
    "key": "email_birthday",
    "rank": 78,
    "name": "Email Birthday",
    "about_original": "A test app built using NestJS for test the function of scheduler to send birthday message",
    "about": "A test app built using NestJS to test the function of a scheduler to send birthday messages.",
    "description": "Email Birthday is a server-side test application built using NestJS to evaluate the functionality of a scheduler in sending birthday messages. The app leverages NestJS, NodeJS, Swagger, JavaScript, TypeScript, TypeORM, and PostgreSQL to provide users with insights into the capabilities of scheduling features in a server environment.",
    "affiliation": "",
    "platform": "Server",
    "tech_stack": "NestJS, NodeJS, Swagger, JavaScript, TypeScript, TypeORM, PostgreSQL",
    "url": "",
    "source_code": "https://github.com/Alf-Anas/nestjs-email-birthday",
    "year": "2023",
    "status": "Completed",
    "logo": "",
    "file": "",
    "video": "",
    "youtube": ""
  },
  {
    "no": 78,
    "key": "pintu_kemana_saja",
    "rank": 79,
    "name": "Pintu Kemana Saja",
    "about_original": "An android virtual reality app build using Unity to view 360 video around the world",
    "about": "An android virtual reality app built using Unity to view 360 videos around the world.",
    "description": "Pintu Kemana Saja is an Android virtual reality application built using Unity. The app allows users to view 360-degree videos around the world, providing an immersive and captivating experience. Developed with Java, Unity, C#, and Google Cardboard, the app showcases the potential of virtual reality in delivering unique visual content to users.",
    "affiliation": "",
    "platform": "Android, Virtual Reality",
    "tech_stack": "Java, Unity, C#, Google Cardboard",
    "url": "",
    "source_code": "",
    "year": "2020",
    "status": "Archived",
    "logo": "pintu_kemana_saja.png",
    "file": "",
    "video": "pintu_kemana_saja.mp4",
    "youtube": ""
  },
  {
    "no": 79,
    "key": "poke_ar_tcg",
    "rank": 80,
    "name": "Poke AR TCG",
    "about_original": "An android augmented reality app using AR image marker for displaying 3D model of Pokemon",
    "about": "An android augmented reality app using AR image markers for displaying 3D models of Pokmon.",
    "description": "Poke AR TCG is an Android augmented reality application using AR image markers to display 3D models of Pokmon. The app, developed with Java, Unity, C#, and Vuforia Engine, offers users an interactive and engaging experience, blending the virtual world of Pokmon with the real world through augmented reality technology.",
    "affiliation": "",
    "platform": "Android, Augmeted Reality",
    "tech_stack": "Java, Unity, C#, Vuforia Engine",
    "url": "",
    "source_code": "",
    "year": "2020",
    "status": "Archived",
    "logo": "",
    "file": "",
    "video": "",
    "youtube": ""
  },
  {
    "no": 80,
    "key": "krakatau_app",
    "rank": 81,
    "name": "Krakatau App",
    "about_original": "An android augmented reality app using AR image marker for displaying 3D model of Krakatau Mountain",
    "about": "An android augmented reality app using AR image markers for displaying 3D models of Krakatau Mountain.",
    "description": "Krakatau App is an Android augmented reality application using AR image markers to display 3D models of Krakatau Mountain. Developed with Java, Unity, C#, and Vuforia Engine, the app provides users with an immersive and educational experience, allowing them to explore and learn about Krakatau through augmented reality technology.",
    "affiliation": "",
    "platform": "Android, Augmented Reality",
    "tech_stack": "Java, Unity, C#, Vuforia Engine",
    "url": "",
    "source_code": "",
    "year": "2020",
    "status": "Archived",
    "logo": "krakatau_app.png",
    "file": "",
    "video": "krakatau_app.mp4",
    "youtube": ""
  },
  {
    "no": 81,
    "key": "shortest_path",
    "rank": 82,
    "name": "Shortest Path",
    "about_original": "A js function to find the shortest path",
    "about": "A JavaScript function to find the shortest path.",
    "description": "Shortest Path is a web application developed by PT. Pratama Persada Airborne. The app features a JavaScript function designed to find the shortest path. Built with PHP, JavaScript, HTML, CSS, and Mapbox GL JS, the app serves as a tool for efficiently determining the shortest route, catering to the specific needs of PT. Pratama Persada Airborne.",
    "affiliation": "ppa",
    "platform": "Web",
    "tech_stack": "PHP, JavaScript, HTML, CSS, Mapbox GL JS",
    "url": "",
    "source_code": "",
    "year": "2020",
    "status": "Archived",
    "logo": "",
    "file": "",
    "video": "",
    "youtube": ""
  }
 ]